In [2]:
import pandas as pd
# Create a sample DataFrame
data ={
    'Name': ['Elon','Mark','Bill',None,'Alex'],
    'Age' : [25,None,45,34,54],
    'Salary':[5000,30000,None,54344,None]
}

#From dictionaries Convert into Pandas DataFrame
df=pd.DataFrame(data)

In [3]:
df

   Name   Age   Salary
0  Elon  25.0   5000.0
1  Mark   NaN  30000.0
2  Bill  45.0      NaN
3  None  34.0  54344.0
4  Alex  54.0      NaN

# Handling Null Value

In [4]:
# 1. Remove rows with any null value using dropna
df_cleaned1=df.dropna()
df_cleaned1

   Name   Age  Salary
0  Elon  25.0  5000.0

In [7]:
# 2.Fill null values with a specific value
df_cleaned2 = df.fillna(0)
df_cleaned2

   Name   Age   Salary
0  Elon  25.0   5000.0
1  Mark   0.0  30000.0
2  Bill  45.0      0.0
3     0  34.0  54344.0
4  Alex  54.0      0.0

In [10]:
# 3.Fill null values with the mean of the column
df_cleaned3=df.fillna(df.mean())
df_cleaned3

C:\Users\User\AppData\Local\Temp\ipykernel_22260\2836129202.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_cleaned3=df.fillna(df.mean())

   Name   Age        Salary
0  Elon  25.0   5000.000000
1  Mark  39.5  30000.000000
2  Bill  45.0  29781.333333
3  None  34.0  54344.000000
4  Alex  54.0  29781.333333

In [11]:
# 4. Fill null with Forward Fill
df_cleaned4=df.ffill()
df_cleaned4

   Name   Age   Salary
0  Elon  25.0   5000.0
1  Mark  25.0  30000.0
2  Bill  45.0  30000.0
3  Bill  34.0  54344.0
4  Alex  54.0  54344.0

In [12]:
# 5. Fill null with Backward Fill
df_cleaned5=df.bfill()
df_cleaned5

   Name   Age   Salary
0  Elon  25.0   5000.0
1  Mark  45.0  30000.0
2  Bill  45.0  54344.0
3  Alex  34.0  54344.0
4  Alex  54.0      NaN

# Drop unnecessary Row or Colomuns

In [14]:
df=df.drop('Name',axis=1) # 1 means column
df

    Age   Salary
0  25.0   5000.0
1   NaN  30000.0
2  45.0      NaN
3  34.0  54344.0
4  54.0      NaN

In [16]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool